public/autobiography/university.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../index.html">Giovanni's Diary</a> &gt; <a href="chronological.html">Chronological</a> &gt;
</p>

<div id="outline-container-orgb332d5d" class="outline-2">
<h2 id="orgb332d5d">University</h2>
<div class="outline-text-2" id="text-orgb332d5d">
<p>
The first year of university I was feeling a lot of pressure and
anxiety, yet I managed to be stoic about It and kept pushing
through. At the end of January 2023 I travelled across Europe alone
with <a href="../stash/photography/interrail.html">interrail</a>, this was meant as a voyage of self discovery and I
wrote hundreds of pages of my diary. It was a period where I felt
stuck and I was uncertain about my future. In the second half of the
year I began <a href="../stash/volunteering.html">volunteering</a> in a local hiking association. I was
organizing hikes for groups of kids, I felt a lot of responsibility
but I also had a lot of fun. I learned a lot. In the summer I went one
week in the mountains and I joined a folk dances group.
</p>

<p>
In my second year at university was a difficult year, by the end of it
I went through a big breakdown that would follow me for another
year. I decided to focus fully on studying computer science, which is
what I have always liked. I began intermediate projects like a <a href="https://github.com/San7o/Brenta-Engine">game
engine</a> and a <a href="https://github.com/San7o/Baldo-Scanner">vulnerability scanner</a> and I got into Linux kernel
development and cloud computing.
</p>

<p>
To be continued&#x2026;
</p>

<hr />

<p>
&gt; <a href="early-life.html">Early Life</a> &gt; <a href="middle-school.html">Middle School</a> &gt; <a href="high-school.html">High School</a> &gt; University - &#x2026;
</p>
</div>
</div>
</div>
</body>
</html>
